%实验1第一题的结果
function Res()
clc;clear;
%W1的数据
x1 = [0.42,-0.2,1.3,0.39,-1.6,-0.029,-0.23,0.27,-1.9,0.87];
x2 = [-0.087,-3.3,-0.32,0.71,-5.3,0.89,1.9,-0.3,0.76,-1.0];
x3 = [0.58,-3.4,1.7,0.23,-0.15,-4.7,2.2,-0.87,-2.1,-2.6];
%W2的数据
w1 = [-0.4,-0.31,0.38,-0.15,-0.35,0.17,-0.011,-0.27,-0.065,-0.12];
w2 = [0.58,0.27,0.055,0.53,0.47,0.69,0.55,0.61,0.49,0.054];
w3 = [0.089,-0.04,-0.035,0.011,0.034,0.1,-0.18,0.12,0.0012,-0.063];

%----------------------------第一问-----------------------------%
[E1,S1]=MLValue(x1);
[E2,S2]=MLValue(x2);
[E3,S3]=MLValue(x3);

fprintf('\nx1的均值,方差分别为：\n')
fprintf('%f\t%f\n',E1,S1);
fprintf('\nx2的均值,方差分别为：\n')
fprintf('%f\t%f\n',E2,S2);
fprintf('\nx3的均值,方差分别为：\n')
fprintf('%f\t%f\n',E3,S3);
%----------------------------第二问-----------------------------%
[E12,S12] = MLValue2D(x1,x2);%x1 x2混合
[E13,S13] = MLValue2D(x1,x3);
[E23,S23] = MLValue2D(x2,x3);

fprintf('\nx1,x2 特征组合的均值为：\n')
E12
fprintf('\nx1,x2 特征组合的协方差为：\n')
S12
fprintf('\nx1,x3 特征组合的均值为：\n')
E13
fprintf('\nx1,x3 特征组合的协方差为：\n')
S13
fprintf('\nx2,x3 特征组合的均值为：\n')
E23
fprintf('\nx2,x3 特征组合的协方差为：\n')
S23
%----------------------------第三问-----------------------------%
[E3d,S3d] = MLValue3D(x1,x2,x3);
fprintf('三维情况下的均值为：\n')
E3d
fprintf('三维情况下的协方差为：\n')
S3d
%----------------------------第四问-----------------------------%
[EE1,SS1]=MLValue(w1);
[EE2,SS2]=MLValue(w2);
[EE3,SS3]=MLValue(w3);
Ew2 = [EE1,EE2,EE3];
Sw2 = [SS1 0 0;0 SS2 0;0 0 SS3];
fprintf('W2在三维情况下的均值为：\n')
Ew2
fprintf('W2在三维情况下的协方差为：\n')
Sw2









